betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_mmc.c
#define MMC_EXT_CSD_PWR_CL_26_POS       24
#define MMC_EXT_CSD_PWR_CL_52_POS       16
#define MMC_EXT_CSD_PWR_CL_DDR_52_POS   24
#endif

/* Frequencies used in the driver for clock divider calculation */
#define MMC_INIT_FREQ                   400000U   /* Initialization phase : 400 kHz max */
/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
/** @defgroup MMC_Private_Functions MMC Private Functions
  * @{
  */
static uint32_t MMC_InitCard(MMC_HandleTypeDef *hmmc);
static uint32_t MMC_PowerON(MMC_HandleTypeDef *hmmc);
static uint32_t MMC_SendStatus(MMC_HandleTypeDef *hmmc, uint32_t *pCardStatus);
static uint32_t MMC_ReadExtCSD(MMC_HandleTypeDef *hmmc, uint32_t *pFieldData, uint16_t FieldIndex, uint32_t Timeout);
static void     MMC_PowerOFF(MMC_HandleTypeDef *hmmc);
static void     MMC_Write_IT(MMC_HandleTypeDef *hmmc);
static void     MMC_Read_IT(MMC_HandleTypeDef *hmmc);
static void     MMC_DMATransmitCplt(DMA_HandleTypeDef *hdma);
static void     MMC_DMAReceiveCplt(DMA_HandleTypeDef *hdma);
static void     MMC_DMAError(DMA_HandleTypeDef *hdma);
static void     MMC_DMATxAbort(DMA_HandleTypeDef *hdma);
static void     MMC_DMARxAbort(DMA_HandleTypeDef *hdma);
static uint32_t MMC_PwrClassUpdate(MMC_HandleTypeDef *hmmc, uint32_t Wide);
/**
  * @}
  */
/* Exported functions --------------------------------------------------------*/
/** @addtogroup MMC_Exported_Functions
  * @{
  */

/** @addtogroup MMC_Exported_Functions_Group1
 *  @brief   Initialization and de-initialization functions
 *
@verbatim
  ==============================================================================
          ##### Initialization and de-initialization functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to initialize/de-initialize the MMC
    card device to be ready for use.

@endverbatim
  * @{
  */

/**
  * @brief  Initializes the MMC according to the specified parameters in the
            MMC_HandleTypeDef and create the associated handle.
  * @param  hmmc: Pointer to the MMC handle
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_MMC_Init(MMC_HandleTypeDef *hmmc)
{
  /* Check the MMC handle allocation */
  if(hmmc == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the parameters */
  ASSERT_PARAM(IS_SDIO_ALL_INSTANCE(hmmc->Instance));
  ASSERT_PARAM(IS_SDIO_CLOCK_EDGE(hmmc->Init.ClockEdge));
  ASSERT_PARAM(IS_SDIO_CLOCK_BYPASS(hmmc->Init.ClockBypass));
  ASSERT_PARAM(IS_SDIO_CLOCK_POWER_SAVE(hmmc->Init.ClockPowerSave));
  ASSERT_PARAM(IS_SDIO_BUS_WIDE(hmmc->Init.BusWide));
  ASSERT_PARAM(IS_SDIO_HARDWARE_FLOW_CONTROL(hmmc->Init.HardwareFlowControl));
  ASSERT_PARAM(IS_SDIO_CLKDIV(hmmc->Init.ClockDiv));

  if(hmmc->State == DAL_MMC_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    hmmc->Lock = DAL_UNLOCKED;
#if defined (USE_DAL_MMC_REGISTER_CALLBACKS) && (USE_DAL_MMC_REGISTER_CALLBACKS == 1U)
    /* Reset Callback pointers in DAL_MMC_STATE_RESET only */
    hmmc->TxCpltCallback    = DAL_MMC_TxCpltCallback;
    hmmc->RxCpltCallback    = DAL_MMC_RxCpltCallback;
    hmmc->ErrorCallback     = DAL_MMC_ErrorCallback;
    hmmc->AbortCpltCallback = DAL_MMC_AbortCallback;

    if(hmmc->MspInitCallback == NULL)
    {
      hmmc->MspInitCallback = DAL_MMC_MspInit;
    }

    /* Init the low level hardware */
    hmmc->MspInitCallback(hmmc);
#else
    /* Init the low level hardware : GPIO, CLOCK, CORTEX...etc */
    DAL_MMC_MspInit(hmmc);
#endif
  }

  hmmc->State = DAL_MMC_STATE_BUSY;

  /* Initialize the Card parameters */
  if(DAL_MMC_InitCard(hmmc) == DAL_ERROR)
  {
    return DAL_ERROR;
  }

  /* Initialize the error code */
  hmmc->ErrorCode = DAL_MMC_ERROR_NONE;

  /* Initialize the MMC operation */
  hmmc->Context = MMC_CONTEXT_NONE;

  /* Initialize the MMC state */
  hmmc->State = DAL_MMC_STATE_READY;

  /* Configure bus width */
  if (hmmc->Init.BusWide != SDIO_BUS_WIDE_1B)
  {
    if (DAL_MMC_ConfigWideBusOperation(hmmc, hmmc->Init.BusWide) != DAL_OK)
    {
      return DAL_ERROR;
    }
  }

  return DAL_OK;
}

/**
  * @brief  Initializes the MMC Card.
  * @param  hmmc: Pointer to MMC handle
  * @note   This function initializes the MMC card. It could be used when a card
            re-initialization is needed.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_MMC_InitCard(MMC_HandleTypeDef *hmmc)
{
  uint32_t errorstate;
  MMC_InitTypeDef Init;
  DAL_StatusTypeDef status;
  
  /* Default SDIO peripheral configuration for MMC card initialization */
  Init.ClockEdge           = SDIO_CLOCK_EDGE_RISING;
  Init.ClockBypass         = SDIO_CLOCK_BYPASS_DISABLE;
  Init.ClockPowerSave      = SDIO_CLOCK_POWER_SAVE_DISABLE;
  Init.BusWide             = SDIO_BUS_WIDE_1B;
  Init.HardwareFlowControl = SDIO_HARDWARE_FLOW_CONTROL_DISABLE;
  Init.ClockDiv            = SDIO_INIT_CLK_DIV;

  /* Initialize SDIO peripheral interface with default configuration */
  status = SDIO_Init(hmmc->Instance, Init);
  if(status == DAL_ERROR)
  {
    return DAL_ERROR;
  }

  /* Disable SDIO Clock */
  __DAL_MMC_DISABLE(hmmc); 
  
  /* Set Power State to ON */
  status = SDIO_PowerState_ON(hmmc->Instance);
  if(status == DAL_ERROR)
  {
    return DAL_ERROR;
  }

  /* Enable MMC Clock */
  __DAL_MMC_ENABLE(hmmc);

  /* Required power up waiting time before starting the MMC initialization  sequence */
  DAL_Delay(2);

  /* Identify card operating voltage */
  errorstate = MMC_PowerON(hmmc);
  if(errorstate != DAL_MMC_ERROR_NONE)
  {
    hmmc->State = DAL_MMC_STATE_READY;
    hmmc->ErrorCode |= errorstate;
    return DAL_ERROR;
  }

  /* Card initialization */
  errorstate = MMC_InitCard(hmmc);
  if(errorstate != DAL_MMC_ERROR_NONE)
  {
    hmmc->State = DAL_MMC_STATE_READY;
    hmmc->ErrorCode |= errorstate;
    return DAL_ERROR;
  }

  /* Set Block Size for Card */
  errorstate = SDMMC_CmdBlockLength(hmmc->Instance, MMC_BLOCKSIZE);
  if(errorstate != DAL_MMC_ERROR_NONE)
  {
    /* Clear all the static flags */
    __DAL_MMC_CLEAR_FLAG(hmmc, SDIO_STATIC_FLAGS);
    hmmc->ErrorCode |= errorstate;
    hmmc->State = DAL_MMC_STATE_READY;
    return DAL_ERROR;
  }

  return DAL_OK;
}

/**
  * @brief  De-Initializes the MMC card.
  * @param  hmmc: Pointer to MMC handle
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_MMC_DeInit(MMC_HandleTypeDef *hmmc)
{
  /* Check the MMC handle allocation */
  if(hmmc == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the parameters */
  ASSERT_PARAM(IS_SDIO_ALL_INSTANCE(hmmc->Instance));

