betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_mmc.c
#if defined (USE_DAL_MMC_REGISTER_CALLBACKS) && (USE_DAL_MMC_REGISTER_CALLBACKS == 1U)
/**
  * @brief  Register a User MMC Callback
  *         To be used instead of the weak (surcharged) predefined callback
  * @param hmmc : MMC handle
  * @param CallbackId : ID of the callback to be registered
  *        This parameter can be one of the following values:
  *          @arg @ref DAL_MMC_TX_CPLT_CB_ID    MMC Tx Complete Callback ID
  *          @arg @ref DAL_MMC_RX_CPLT_CB_ID    MMC Rx Complete Callback ID
  *          @arg @ref DAL_MMC_ERROR_CB_ID      MMC Error Callback ID
  *          @arg @ref DAL_MMC_ABORT_CB_ID      MMC Abort Callback ID
  *          @arg @ref DAL_MMC_MSP_INIT_CB_ID   MMC MspInit Callback ID
  *          @arg @ref DAL_MMC_MSP_DEINIT_CB_ID MMC MspDeInit Callback ID
  * @param pCallback : pointer to the Callback function
  * @retval status
  */
DAL_StatusTypeDef DAL_MMC_RegisterCallback(MMC_HandleTypeDef *hmmc, DAL_MMC_CallbackIDTypeDef CallbackId, pMMC_CallbackTypeDef pCallback)
{
  DAL_StatusTypeDef status = DAL_OK;

  if(pCallback == NULL)
  {
    /* Update the error code */
    hmmc->ErrorCode |= DAL_MMC_ERROR_INVALID_CALLBACK;
    return DAL_ERROR;
  }

  /* Process locked */
  __DAL_LOCK(hmmc);

  if(hmmc->State == DAL_MMC_STATE_READY)
  {
    switch (CallbackId)
    {
    case DAL_MMC_TX_CPLT_CB_ID :
      hmmc->TxCpltCallback = pCallback;
      break;
    case DAL_MMC_RX_CPLT_CB_ID :
      hmmc->RxCpltCallback = pCallback;
      break;
    case DAL_MMC_ERROR_CB_ID :
      hmmc->ErrorCallback = pCallback;
      break;
    case DAL_MMC_ABORT_CB_ID :
      hmmc->AbortCpltCallback = pCallback;
      break;
    case DAL_MMC_MSP_INIT_CB_ID :
      hmmc->MspInitCallback = pCallback;
      break;
    case DAL_MMC_MSP_DEINIT_CB_ID :
      hmmc->MspDeInitCallback = pCallback;
      break;
    default :
      /* Update the error code */
      hmmc->ErrorCode |= DAL_MMC_ERROR_INVALID_CALLBACK;
      /* update return status */
      status =  DAL_ERROR;
      break;
    }
  }
  else if (hmmc->State == DAL_MMC_STATE_RESET)
  {
    switch (CallbackId)
    {
    case DAL_MMC_MSP_INIT_CB_ID :
      hmmc->MspInitCallback = pCallback;
      break;
    case DAL_MMC_MSP_DEINIT_CB_ID :
      hmmc->MspDeInitCallback = pCallback;
      break;
    default :
      /* Update the error code */
      hmmc->ErrorCode |= DAL_MMC_ERROR_INVALID_CALLBACK;
      /* update return status */
      status =  DAL_ERROR;
      break;
    }
  }
  else
  {
    /* Update the error code */
    hmmc->ErrorCode |= DAL_MMC_ERROR_INVALID_CALLBACK;
    /* update return status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(hmmc);
  return status;
}

/**
  * @brief  Unregister a User MMC Callback
  *         MMC Callback is redirected to the weak (surcharged) predefined callback
  * @param hmmc : MMC handle
  * @param CallbackId : ID of the callback to be unregistered
  *        This parameter can be one of the following values:
  *          @arg @ref DAL_MMC_TX_CPLT_CB_ID    MMC Tx Complete Callback ID
  *          @arg @ref DAL_MMC_RX_CPLT_CB_ID    MMC Rx Complete Callback ID
  *          @arg @ref DAL_MMC_ERROR_CB_ID      MMC Error Callback ID
  *          @arg @ref DAL_MMC_ABORT_CB_ID      MMC Abort Callback ID
  *          @arg @ref DAL_MMC_MSP_INIT_CB_ID   MMC MspInit Callback ID
  *          @arg @ref DAL_MMC_MSP_DEINIT_CB_ID MMC MspDeInit Callback ID
  * @retval status
  */
DAL_StatusTypeDef DAL_MMC_UnRegisterCallback(MMC_HandleTypeDef *hmmc, DAL_MMC_CallbackIDTypeDef CallbackId)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Process locked */
  __DAL_LOCK(hmmc);

  if(hmmc->State == DAL_MMC_STATE_READY)
  {
    switch (CallbackId)
    {
    case DAL_MMC_TX_CPLT_CB_ID :
      hmmc->TxCpltCallback = DAL_MMC_TxCpltCallback;
      break;
    case DAL_MMC_RX_CPLT_CB_ID :
      hmmc->RxCpltCallback = DAL_MMC_RxCpltCallback;
      break;
    case DAL_MMC_ERROR_CB_ID :
      hmmc->ErrorCallback = DAL_MMC_ErrorCallback;
      break;
    case DAL_MMC_ABORT_CB_ID :
      hmmc->AbortCpltCallback = DAL_MMC_AbortCallback;
      break;
    case DAL_MMC_MSP_INIT_CB_ID :
      hmmc->MspInitCallback = DAL_MMC_MspInit;
      break;
    case DAL_MMC_MSP_DEINIT_CB_ID :
      hmmc->MspDeInitCallback = DAL_MMC_MspDeInit;
      break;
    default :
      /* Update the error code */
      hmmc->ErrorCode |= DAL_MMC_ERROR_INVALID_CALLBACK;
      /* update return status */
      status =  DAL_ERROR;
      break;
    }
  }
  else if (hmmc->State == DAL_MMC_STATE_RESET)
  {
    switch (CallbackId)
    {
    case DAL_MMC_MSP_INIT_CB_ID :
      hmmc->MspInitCallback = DAL_MMC_MspInit;
      break;
    case DAL_MMC_MSP_DEINIT_CB_ID :
      hmmc->MspDeInitCallback = DAL_MMC_MspDeInit;
      break;
    default :
      /* Update the error code */
      hmmc->ErrorCode |= DAL_MMC_ERROR_INVALID_CALLBACK;
      /* update return status */
      status =  DAL_ERROR;
      break;
    }
  }
  else
  {
    /* Update the error code */
    hmmc->ErrorCode |= DAL_MMC_ERROR_INVALID_CALLBACK;
    /* update return status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(hmmc);
  return status;
}
#endif

/**
  * @}
  */

/** @addtogroup MMC_Exported_Functions_Group3
 *  @brief   management functions
 *
@verbatim
  ==============================================================================
                      ##### Peripheral Control functions #####
  ==============================================================================
  [..]
    This subsection provides a set of functions allowing to control the MMC card
    operations and get the related information

@endverbatim
  * @{
  */

/**
  * @brief  Returns information the information of the card which are stored on
  *         the CID register.
  * @param  hmmc: Pointer to MMC handle
  * @param  pCID: Pointer to a DAL_MMC_CIDTypedef structure that
  *         contains all CID register parameters
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_MMC_GetCardCID(MMC_HandleTypeDef *hmmc, DAL_MMC_CardCIDTypeDef *pCID)
{
  pCID->ManufacturerID = (uint8_t)((hmmc->CID[0] & 0xFF000000U) >> 24U);

  pCID->OEM_AppliID = (uint16_t)((hmmc->CID[0] & 0x00FFFF00U) >> 8U);

  pCID->ProdName1 = (((hmmc->CID[0] & 0x000000FFU) << 24U) | ((hmmc->CID[1] & 0xFFFFFF00U) >> 8U));

  pCID->ProdName2 = (uint8_t)(hmmc->CID[1] & 0x000000FFU);

  pCID->ProdRev = (uint8_t)((hmmc->CID[2] & 0xFF000000U) >> 24U);

  pCID->ProdSN = (((hmmc->CID[2] & 0x00FFFFFFU) << 8U) | ((hmmc->CID[3] & 0xFF000000U) >> 24U));

